# Units Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Units Properties
Units Class See Also
---
The Units type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DecimalSymbol | The symbol used to separate the integer and fractional parts of a number. |
| DigitGroupingAmount | The number of digits in each group when numbers are formatted with digit grouping. |
| DigitGroupingSymbol | The symbol used to separate groups of digits when numbers are formatted with digit grouping. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
Units Class
Autodesk.Revit.DB Namespace